Revit 2025 API
ExternalDataInstanceRemovedFromDocumentEventArgs.TypeId Property
 The type id of the external data instance id that has been removed from Revit document.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public ElementId TypeId { get; }
Public ReadOnly Property TypeId As ElementId
	Get
public:
property ElementId^ TypeId {
	ElementId^ get ();
}
member TypeId : ElementId with get
Property Value
ElementId
See Also
Reference
ExternalDataInstanceRemovedFromDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace